genestealer/everblu-meters-esp8266-improved/src/main.cpp
// Global variable to store the reading schedule (default from private.h)
const char* readingSchedule = DEFAULT_READING_SCHEDULE;

// ============================================================================
// Schedule Validation API
// ============================================================================

/**
 * @brief Validate reading schedule string
 * 
 * @param s Schedule string to validate
 * @return true if schedule is one of: "Monday-Friday", "Monday-Saturday", "Monday-Sunday"
 */
static bool isValidReadingSchedule(const char* s) {
  return (strcmp(s, "Monday-Friday") == 0 || 
          strcmp(s, "Monday-Saturday") == 0 || 
          strcmp(s, "Monday-Sunday") == 0);
}

/**
 * @brief Validate and correct reading schedule
 * 
 * Checks if current reading schedule is valid. If invalid, falls back
 * to safe default ("Monday-Friday") and logs a warning.
 */
static void validateReadingSchedule() {
  if (!isValidReadingSchedule(readingSchedule)) {
    Serial.printf("WARNING: Invalid reading schedule '%s'. Falling back to 'Monday-Friday'.\n", readingSchedule);
    readingSchedule = "Monday-Friday";
  }
}

/**
 * @brief Check if today is a scheduled reading day
 * 
 * Evaluates whether the current day (based on tm structure) falls within
 * the configured reading schedule.
 * 
 * @param ptm Pointer to tm structure with current date/time
 * @return true if today is a reading day according to schedule
 */
bool isReadingDay(struct tm *ptm) {
  if (strcmp(readingSchedule, "Monday-Friday") == 0) {
    return ptm->tm_wday >= 1 && ptm->tm_wday <= 5; // Monday to Friday
  } else if (strcmp(readingSchedule, "Monday-Saturday") == 0) {
    return ptm->tm_wday >= 1 && ptm->tm_wday <= 6; // Monday to Saturday
  } else if (strcmp(readingSchedule, "Monday-Sunday") == 0) {
    return true; // Every day
  }
  return false;
}

// ============================================================================
// Signal Quality Conversion API
// ============================================================================

/**
 * @brief Convert WiFi RSSI to percentage
 * 
 * Maps WiFi RSSI value to 0-100% scale for user-friendly display.
 * Clamps input to reasonable range (-100 to -50 dBm).
 * 
 * @param rssi WiFi RSSI in dBm (typically -100 to -50)
 * @return Signal strength as percentage (0-100)
 */
int calculateWiFiSignalStrengthPercentage(int rssi) {
  int strength = constrain(rssi, -100, -50); // Clamp RSSI to a reasonable range
  return map(strength, -100, -50, 0, 100);   // Map RSSI to percentage (0-100%)
}

/**
 * @brief Convert 433 MHz meter RSSI to percentage
 * 
 * Converts CC1101 RSSI measurement (in dBm) to 0-100% scale.
 * Uses wider range (-120 to -40 dBm) appropriate for sub-GHz band.
 * 
 * @param rssi_dbm Meter RSSI in dBm (typically -120 to -40)
 * @return Signal strength as percentage (0-100)
 */
int calculateMeterdBmToPercentage(int rssi_dbm) {
  // Clamp RSSI to a reasonable range (e.g., -120 dBm to -40 dBm)
  int clamped_rssi = constrain(rssi_dbm, -120, -40);
  
  // Map the clamped RSSI value to a percentage (0-100%)
  return map(clamped_rssi, -120, -40, 0, 100);
}

/**
 * @brief Convert LQI to percentage
 * 
 * Converts CC1101 Link Quality Indicator (0-255) to 0-100% scale.
 * LQI represents overall link quality including interference effects.
 * 
 * @param lqi Link Quality Indicator (0-255, higher is better)
 * @return Link quality as percentage (0-100)
 */
int calculateLQIToPercentage(int lqi) {
  int strength = constrain(lqi, 0, 255); // Clamp LQI to valid range
  return map(strength, 0, 255, 0, 100);  // Map LQI to percentage
}

// ------------------------------
// Connectivity watchdog state
// ------------------------------
static unsigned long g_bootMillis = 0;
static unsigned long g_wifiAttemptStartMs = 0;
static unsigned long g_mqttAttemptStartMs = 0;
static unsigned long g_wifiOfflineSince = 0;
static unsigned long g_mqttOfflineSince = 0;
static unsigned long g_lastConnLogMs = 0;
static unsigned long g_lastLedBlinkMs = 0;
static bool g_ledState = false;
static bool g_prevWifiUp = false;
static bool g_prevMqttUp = false;

// Helper: translate Wi-Fi wl_status_t to readable string
static const char* wifiStatusToString(wl_status_t st) {
  switch (st) {
    case WL_IDLE_STATUS:      return "IDLE (starting up)";
    case WL_NO_SSID_AVAIL:    return "NO_SSID_AVAIL (SSID not found)";
    case WL_SCAN_COMPLETED:   return "SCAN_COMPLETED";
    case WL_CONNECTED:        return "CONNECTED";
    case WL_CONNECT_FAILED:   return "CONNECT_FAILED";
    case WL_CONNECTION_LOST:  return "CONNECTION_LOST";
    case WL_DISCONNECTED:     return "DISCONNECTED";
    #ifdef WL_WRONG_PASSWORD
    case WL_WRONG_PASSWORD:   return "WRONG_PASSWORD";
    #endif
    default:                  return "UNKNOWN";
  }
}


// Function: onUpdateData
// Description: Fetches data from the water meter and publishes it to MQTT topics.
//              Retries up to 10 times if data retrieval fails.
void onUpdateData()
{
  Serial.printf("Updating data from meter...\n");
  Serial.printf("Retry count : %d\n", _retry);
  Serial.printf("Reading schedule : %s\n", readingSchedule);

  // Increment total attempts counter
  totalReadAttempts++;

  // Indicate activity with LED
  digitalWrite(LED_BUILTIN, LOW); // Turn on LED to indicate activity

  // Notify MQTT that active reading has started
  mqtt.publish("everblu/cyble/active_reading", "true", true);
  mqtt.publish("everblu/cyble/cc1101_state", "Reading", true);

  struct tmeter_data meter_data = get_meter_data(); // Fetch meter data

  // Get current UTC time
  time_t tnow = time(nullptr);
  struct tm *ptm = gmtime(&tnow);
  Serial.printf("Current date (UTC) : %04d/%02d/%02d %02d:%02d/%02d - %ld\n", ptm->tm_year + 1900, ptm->tm_mon + 1, ptm->tm_mday, ptm->tm_hour, ptm->tm_min, ptm->tm_sec, (long)tnow);

  char iso8601[128];
  strftime(iso8601, sizeof iso8601, "%FT%TZ", gmtime(&tnow));

  // Handle data retrieval failure (including first-layer protection rejecting
  // corrupted frames and returning zeros).
  if (meter_data.reads_counter == 0 || meter_data.liters == 0) {
    Serial.printf("Unable to retrieve data from meter (attempt %d/%d)\n", _retry + 1, MAX_RETRIES);
    
    if (_retry < MAX_RETRIES - 1) {
      // Schedule retry using callback instead of recursion to prevent stack overflow
      _retry++;
      static char errorMsg[64];
      snprintf(errorMsg, sizeof(errorMsg), "Retry %d/%d - No data received", _retry, MAX_RETRIES);
      lastErrorMessage = errorMsg;
      Serial.printf("Scheduling retry in 10 seconds... (next attempt %d/%d)\n", _retry + 1, MAX_RETRIES);
      mqtt.publish("everblu/cyble/active_reading", "false", true);
      mqtt.publish("everblu/cyble/cc1101_state", "Idle", true);
      mqtt.publish("everblu/cyble/last_error", lastErrorMessage, true);
      digitalWrite(LED_BUILTIN, HIGH); // Turn off LED
      // Use non-blocking callback instead of recursive call
      mqtt.executeDelayed(10000, onUpdateData);
    } else {
      // Max retries reached, enter cooldown period
      lastFailedAttempt = millis();
      failedReads++;
      lastErrorMessage = "Max retries reached - cooling down";
      Serial.printf("Max retries (%d) reached. Entering 1-hour cooldown period.\n", MAX_RETRIES);
      mqtt.publish("everblu/cyble/active_reading", "false", true);
      mqtt.publish("everblu/cyble/cc1101_state", "Idle", true);
      mqtt.publish("everblu/cyble/status_message", "Failed after max retries, cooling down for 1 hour", true);
      mqtt.publish("everblu/cyble/last_error", lastErrorMessage, true);
      
      char buffer[16];
      snprintf(buffer, sizeof(buffer), "%lu", failedReads);
      mqtt.publish("everblu/cyble/failed_reads", buffer, true);
      
      snprintf(buffer, sizeof(buffer), "%lu", totalReadAttempts);
      mqtt.publish("everblu/cyble/total_attempts", buffer, true);
      digitalWrite(LED_BUILTIN, HIGH); // Turn off LED
      _retry = 0; // Reset retry counter for next scheduled attempt
    }
    return;
  }

  
  // Format int time_start and time_end as "HH:MM"
  char timeStartFormatted[6];
  char timeEndFormatted[6];
  int timeStart = constrain(meter_data.time_start, 0, 23); // Ensure valid hour range
  int timeEnd = constrain(meter_data.time_end, 0, 23);     // Ensure valid hour range
  snprintf(timeStartFormatted, sizeof(timeStartFormatted), "%02d:00", timeStart);
  snprintf(timeEndFormatted, sizeof(timeEndFormatted), "%02d:00", timeEnd);

