genestealer/everblu-meters-esp8266-improved/src/main.cpp
  Serial.printf("Data from meter:\n");
  Serial.printf("Liters : %d\nBattery (in months) : %d\nCounter : %d\nRSSI : %d\nTime start : %s\nTime end : %s\n\n", meter_data.liters, meter_data.battery_left, meter_data.reads_counter, meter_data.rssi, timeStartFormatted, timeEndFormatted);
  Serial.printf("RSSI (dBm) : %d\n", meter_data.rssi_dbm);
  Serial.printf("RSSI (percentage) : %d\n", calculateMeterdBmToPercentage(meter_data.rssi_dbm));
  Serial.printf("Signal quality (LQI) : %d\n", meter_data.lqi);
  Serial.printf("Signal quality (LQI percentage) : %d\n", calculateLQIToPercentage(meter_data.lqi));

  // Publish meter data to MQTT (using char buffers instead of String)
  char valueBuffer[32];
  
  snprintf(valueBuffer, sizeof(valueBuffer), "%d", meter_data.liters);
  mqtt.publish("everblu/cyble/liters", valueBuffer, true);
  delay(5);
  
  // Publish historical data as JSON attributes for Home Assistant
  // This provides 13 months of historical volume readings that can be accessed as attributes
  // in Home Assistant. Each value represents the total volume at the end of that month.
  // The meter stores these internally with timestamps, but the RADIAN protocol only
  // returns the volume values without dates.
  if (meter_data.history_available) {
    // Count valid historical values (non-zero)
    int num_history = 0;
    for (int i = 0; i < 13; i++) {
      if (meter_data.history[i] == 0) break;
      num_history++;
    }
    
    Serial.printf("\n=== Historical Data (%d months) ===\n", num_history);
    Serial.println("Month  Volume (L)  Usage (L)");
    Serial.println("-----  ----------  ---------");
    
    // Calculate monthly consumption from the historical data
    // Format: {"history": [oldest_volume, ..., newest_volume], "monthly_usage": [month1_usage, ..., month13_usage]}
    char historyJson[800];
    int pos = 0;
    
    // Start JSON object
    pos += snprintf(historyJson + pos, sizeof(historyJson) - pos, "{\"history\":[");
    
    // Add historical volumes and print to serial
    for (int i = 0; i < num_history; i++) {
      pos += snprintf(historyJson + pos, sizeof(historyJson) - pos, "%s%u", 
                      (i > 0 ? "," : ""), meter_data.history[i]);
      
      // Calculate and display monthly usage
      uint32_t usage = 0;
      if (i > 0 && meter_data.history[i] > meter_data.history[i - 1]) {
        usage = meter_data.history[i] - meter_data.history[i - 1];
      }
      Serial.printf(" -%02d   %10u  %9u\n", num_history-i, meter_data.history[i], usage);
    }
    
    // Calculate current month usage (difference from most recent historical reading)
    uint32_t currentMonthUsage = 0;
    uint32_t currentLiters = static_cast<uint32_t>(meter_data.liters);
    if (num_history > 0 && currentLiters > meter_data.history[num_history - 1]) {
      currentMonthUsage = currentLiters - meter_data.history[num_history - 1];
    }
    Serial.printf("  Now  %10d  %9u (current month)\n", meter_data.liters, currentMonthUsage);
    Serial.println("===================================\n");
    
    // Add monthly usage calculations to JSON
    pos += snprintf(historyJson + pos, sizeof(historyJson) - pos, "],\"monthly_usage\":[");
    for (int i = 0; i < num_history; i++) {
      uint32_t usage;
      if (i == 0) {
        // For oldest month, we can't calculate usage without an older baseline
        usage = 0;
      } else if (meter_data.history[i] > meter_data.history[i - 1]) {
        // Calculate consumption as difference between consecutive months
        usage = meter_data.history[i] - meter_data.history[i - 1];
      } else {
        usage = 0; // Sanity check - shouldn't go backwards
      }
      pos += snprintf(historyJson + pos, sizeof(historyJson) - pos, "%s%u", 
                      (i > 0 ? "," : ""), usage);
    }
    
    pos += snprintf(historyJson + pos, sizeof(historyJson) - pos, 
                    "],\"current_month_usage\":%u,\"months_available\":%d}", 
                    currentMonthUsage, num_history);
    
    Serial.printf("Publishing JSON attributes (%d bytes): %s\n\n", strlen(historyJson), historyJson);
    mqtt.publish("everblu/cyble/liters_attributes", historyJson, true);
    delay(5);
    
    Serial.printf("> Published %d months historical data (current month usage: %u L)\n", 
                  num_history, currentMonthUsage);
  }
  
  snprintf(valueBuffer, sizeof(valueBuffer), "%d", meter_data.reads_counter);
  mqtt.publish("everblu/cyble/counter", valueBuffer, true);
  delay(5);
  
  snprintf(valueBuffer, sizeof(valueBuffer), "%d", meter_data.battery_left);
  mqtt.publish("everblu/cyble/battery", valueBuffer, true);
  delay(5);
  
  snprintf(valueBuffer, sizeof(valueBuffer), "%d", meter_data.rssi_dbm);
  mqtt.publish("everblu/cyble/rssi_dbm", valueBuffer, true);
  delay(5);
  
  snprintf(valueBuffer, sizeof(valueBuffer), "%d", calculateMeterdBmToPercentage(meter_data.rssi_dbm));
  mqtt.publish("everblu/cyble/rssi_percentage", valueBuffer, true);
  delay(5);
  
  snprintf(valueBuffer, sizeof(valueBuffer), "%d", meter_data.lqi);
  mqtt.publish("everblu/cyble/lqi", valueBuffer, true);
  delay(5);
  mqtt.publish("everblu/cyble/time_start", timeStartFormatted, true);
  delay(5);
  mqtt.publish("everblu/cyble/time_end", timeEndFormatted, true);
  delay(5);
  mqtt.publish("everblu/cyble/timestamp", iso8601, true); // timestamp since epoch in UTC
  delay(5);
  
  snprintf(valueBuffer, sizeof(valueBuffer), "%d", calculateLQIToPercentage(meter_data.lqi));
  mqtt.publish("everblu/cyble/lqi_percentage", valueBuffer, true);
  delay(5);

  // Publish all data as a JSON message as well this is redundant but may be useful for some
  char json[512];
  sprintf(json, jsonTemplate, meter_data.liters, meter_data.reads_counter, meter_data.battery_left, meter_data.rssi, iso8601);
  mqtt.publish("everblu/cyble/json", json, true);
  delay(5);

#if AUTO_ALIGN_READING_TIME
  // Optionally auto-align the daily scheduled reading time to the meter's wake window
  {
    int timeStart = constrain(meter_data.time_start, 0, 23);
    int timeEnd = constrain(meter_data.time_end, 0, 23);
    int window = (timeEnd - timeStart + 24) % 24; // hours in window (0 means unknown/all-day)

    if (window > 0) {
#if AUTO_ALIGN_USE_MIDPOINT
  int alignedHourLocal = (timeStart + (window / 2)) % 24; // midpoint (interpreted as local-offset time)
#else
  int alignedHourLocal = timeStart; // start of window (local-offset time)
#endif
  // Update resolved schedule time in LOCAL and derive UTC equivalent
  g_readHourLocal = alignedHourLocal;
  g_readMinuteLocal = DEFAULT_READING_MINUTE_UTC;
  // Simple conversion: UTC = Local - offset
  int totalLocalMin = g_readHourLocal * 60 + g_readMinuteLocal;
  int utcMin = (totalLocalMin - TIMEZONE_OFFSET_MINUTES) % (24 * 60);
  if (utcMin < 0) utcMin += 24 * 60;
  g_readHourUtc = utcMin / 60;
  g_readMinuteUtc = utcMin % 60;

      // Publish updated reading_time HH:MM
      char readingTimeFormatted2[6];
      snprintf(readingTimeFormatted2, sizeof(readingTimeFormatted2), "%02d:%02d", g_readHourUtc, g_readMinuteUtc);
      mqtt.publish("everblu/cyble/reading_time", readingTimeFormatted2, true);
      delay(5);

      Serial.printf("> Auto-aligned reading time to %02d:%02d local-offset (%02d:%02d UTC) (window %02d-%02d local)\n",
                    g_readHourLocal, g_readMinuteLocal, g_readHourUtc, g_readMinuteUtc, timeStart, timeEnd);
    }
  }
#endif

  // Notify MQTT that active reading has ended
  mqtt.publish("everblu/cyble/active_reading", "false", true);
  mqtt.publish("everblu/cyble/cc1101_state", "Idle", true);
  digitalWrite(LED_BUILTIN, HIGH); // Turn off LED to indicate completion

  // Reset retry counter and cooldown on successful read
  _retry = 0;
  lastFailedAttempt = 0;
  successfulReads++;
  lastErrorMessage = "None";

  // Publish success metrics (using char buffers instead of String)
  char metricBuffer[16];
  
  snprintf(metricBuffer, sizeof(metricBuffer), "%lu", successfulReads);
  mqtt.publish("everblu/cyble/successful_reads", metricBuffer, true);
  
  snprintf(metricBuffer, sizeof(metricBuffer), "%lu", totalReadAttempts);
  mqtt.publish("everblu/cyble/total_attempts", metricBuffer, true);
  
  mqtt.publish("everblu/cyble/last_error", "None", true);

  // Perform adaptive frequency tracking based on FREQEST register
  adaptiveFrequencyTracking(meter_data.freqest);

