genestealer/everblu-meters-esp8266-improved/src/main.cpp
// Function: performWideInitialScan
// Description: Performs a wide-band scan on first boot to find meter frequency automatically
//              Scans ±100 kHz around the configured frequency in larger steps for faster discovery
void performWideInitialScan() {
  Serial.println("> Performing wide initial scan (first boot - no saved offset)...");
  mqtt.publish("everblu/cyble/cc1101_state", "Initial Frequency Scan", true);
  mqtt.publish("everblu/cyble/status_message", "First boot: scanning for meter frequency", true);
  
  float baseFreq = FREQUENCY;
  float bestFreq = baseFreq;
  int bestRSSI = -120;
  
  // Wide scan: ±100 kHz in 10 kHz steps for faster initial discovery
  float scanStart = baseFreq - 0.10;
  float scanEnd = baseFreq + 0.10;
  float scanStep = 0.010;
  
  Serial.printf("> Wide scan from %.6f to %.6f MHz (step: %.6f MHz)\n", scanStart, scanEnd, scanStep);
  Serial.println("> This may take 1-2 minutes on first boot...");
  
  for (float freq = scanStart; freq <= scanEnd; freq += scanStep) {
    FEED_WDT(); // Feed watchdog for each frequency step
    cc1101_init(freq);
    delay(100); // Longer delay for frequency to settle during wide scan
    
    struct tmeter_data test_data = get_meter_data();
    
    if (test_data.rssi_dbm > bestRSSI && test_data.reads_counter > 0) {
      bestRSSI = test_data.rssi_dbm;
      bestFreq = freq;
      Serial.printf("> Found signal at %.6f MHz: RSSI=%d dBm\n", freq, test_data.rssi_dbm);
    }
  }
  
  if (bestRSSI > -120) {
    // Found a signal, now do a fine scan around it
    Serial.printf("> Performing fine scan around %.6f MHz...\n", bestFreq);
    float fineStart = bestFreq - 0.015;
    float fineEnd = bestFreq + 0.015;
    float fineStep = 0.003;
    int fineBestRSSI = bestRSSI;
    float fineBestFreq = bestFreq;
    
    for (float freq = fineStart; freq <= fineEnd; freq += fineStep) {
      FEED_WDT(); // Feed watchdog for each frequency step
      cc1101_init(freq);
      delay(50);
      
      struct tmeter_data test_data = get_meter_data();
      
      if (test_data.rssi_dbm > fineBestRSSI && test_data.reads_counter > 0) {
        fineBestRSSI = test_data.rssi_dbm;
        fineBestFreq = freq;
        Serial.printf("> Refined signal at %.6f MHz: RSSI=%d dBm\n", freq, test_data.rssi_dbm);
      }
    }
    
    bestFreq = fineBestFreq;
    bestRSSI = fineBestRSSI;
    
    float offset = bestFreq - baseFreq;
    Serial.printf("> Initial scan complete! Best frequency: %.6f MHz (offset: %.6f MHz, RSSI: %d dBm)\n", 
                  bestFreq, offset, bestRSSI);
    
    saveFrequencyOffset(offset);
    
    char freqBuffer[16];
    snprintf(freqBuffer, sizeof(freqBuffer), "%.3f", offset * 1000.0);  // Convert MHz to kHz
    mqtt.publish("everblu/cyble/frequency_offset", freqBuffer, true);
    
    char statusMsg[128];
    snprintf(statusMsg, sizeof(statusMsg), "Initial scan complete: offset %.3f kHz", offset * 1000.0);
    mqtt.publish("everblu/cyble/status_message", statusMsg, true);
    
    cc1101_init(bestFreq);
  } else {
    Serial.println("> Wide scan failed - no meter signal found!");
    Serial.println("> Please check:");
    Serial.println(">  1. Meter is within range (< 50m typically)");
    Serial.println(">  2. Antenna is connected to CC1101");
    Serial.println(">  3. Meter serial/year are correct in private.h");
    Serial.println(">  4. Current time is within meter's wake hours");
    mqtt.publish("everblu/cyble/status_message", "Initial scan failed - check setup", true);
    cc1101_init(baseFreq);
  }
  
  mqtt.publish("everblu/cyble/cc1101_state", "Idle", true);
}

// ============================================================================
// Frequency Management Implementation
// ============================================================================

/**
 * @brief Adaptive frequency tracking using FREQEST
 * 
 * Accumulates frequency offset estimates from successful reads and gradually
 * adjusts radio frequency to track meter drift. Uses statistical averaging
 * (ADAPT_THRESHOLD reads) to avoid over-correction on noise.
 * 
 * FREQEST register provides frequency error estimate in 2's complement format,
 * with resolution ~1.59 kHz per LSB (26 MHz crystal).
 * 
 * Adjustment logic:
 * - Accumulate FREQEST over multiple reads
 * - After threshold reads, calculate average error
 * - If average > 2 kHz, apply 50% correction to avoid oscillation
 * - Save new offset to persistent storage
 * - Reinitialize CC1101 with corrected frequency
 * 
 * @param freqest Frequency offset estimate from CC1101 FREQEST register (-128 to +127)
 */
void adaptiveFrequencyTracking(int8_t freqest) {
  // FREQEST is a two's complement value representing frequency offset
  // Resolution is approximately Fxosc/2^14 ≈ 1.59 kHz per LSB (for 26 MHz crystal)
  const float FREQEST_TO_MHZ = 0.001587; // Conversion factor: ~1.59 kHz per LSB
  
  // Accumulate the frequency error
  float freqErrorMHz = (float)freqest * FREQEST_TO_MHZ;
  cumulativeFreqError += freqErrorMHz;
  successfulReadsBeforeAdapt++;
  
  Serial.printf("> FREQEST: %d (%.4f kHz error), cumulative: %.4f kHz over %d reads\n", 
                freqest, freqErrorMHz * 1000, cumulativeFreqError * 1000, successfulReadsBeforeAdapt);
  
  // Only adapt after N successful reads to avoid over-correcting on noise
  if (successfulReadsBeforeAdapt >= ADAPT_THRESHOLD) {
    float avgError = cumulativeFreqError / ADAPT_THRESHOLD;
    
    // Only adjust if average error is significant (> 2 kHz)
    if (abs(avgError * 1000) > 2.0) {
      Serial.printf("> Adaptive adjustment: average error %.4f kHz over %d reads\n", 
                    avgError * 1000, ADAPT_THRESHOLD);
      
      // Adjust the stored offset (apply 50% of the measured error to avoid over-correction)
      float adjustment = avgError * 0.5;
      storedFrequencyOffset += adjustment;
      
      Serial.printf("> Adjusting frequency offset by %.6f MHz (new offset: %.6f MHz)\n", 
                    adjustment, storedFrequencyOffset);
      
      saveFrequencyOffset(storedFrequencyOffset);
      
      char freqBuffer[16];
      snprintf(freqBuffer, sizeof(freqBuffer), "%.3f", storedFrequencyOffset * 1000.0);  // Convert MHz to kHz
      mqtt.publish("everblu/cyble/frequency_offset", freqBuffer, true);
      
      // Reinitialize CC1101 with adjusted frequency
      cc1101_init(FREQUENCY + storedFrequencyOffset);
    } else {
      Serial.printf("> Frequency stable (avg error %.4f kHz < 2 kHz threshold)\n", avgError * 1000);
    }
    
    // Reset accumulators
    cumulativeFreqError = 0.0;
    successfulReadsBeforeAdapt = 0;
  }
}


/**
 * @brief Validate configuration parameters
 * 
 * Performs startup validation of configuration parameters to fail fast
 * on invalid settings. Checks:
 * - METER_YEAR (must be 0-99)
 * - METER_SERIAL (must be non-zero)
 * - FREQUENCY (must be 300-500 MHz if defined)
 * - READING_HOUR/MINUTE (must be valid time)
 * - Reading schedule string format
 * 
 * Logs validation results to serial console with ✓ or ERROR markers.
 * 
 * @return true if all validations passed, false if any parameter is invalid
 */
bool validateConfiguration() {
  bool valid = true;
  
  Serial.println("\n=== Configuration Validation ===");
  
  // Validate METER_YEAR (should be 0-99 for years 2000-2099)
  if (METER_YEAR > 99) {
    Serial.printf("ERROR: Invalid METER_YEAR=%d (expected 0-99)\n", METER_YEAR);
    valid = false;
  } else {
    Serial.printf("✓ METER_YEAR: %d (20%02d)\n", METER_YEAR, METER_YEAR);
  }
  
  // Validate METER_SERIAL (should not be 0)
  if (METER_SERIAL == 0) {
    Serial.println("ERROR: METER_SERIAL not configured (value is 0)");
    Serial.println("       Update METER_SERIAL in private.h with your meter's serial number");
    valid = false;
  } else {
    Serial.printf("✓ METER_SERIAL: %lu\n", (unsigned long)METER_SERIAL);
  }
  
  // Validate FREQUENCY if defined (should be 300-500 MHz for 433 MHz band)
  #ifdef FREQUENCY
  if (FREQUENCY < 300.0 || FREQUENCY > 500.0) {
    Serial.printf("ERROR: Invalid FREQUENCY=%.2f MHz (expected 300-500 MHz)\n", FREQUENCY);
    valid = false;
  } else {
    Serial.printf("✓ FREQUENCY: %.6f MHz\n", FREQUENCY);
  }
  #else
  Serial.println("✓ FREQUENCY: Using default 433.82 MHz (RADIAN protocol)");
  #endif
  
  // Validate GDO0 pin (basic check - should be defined)
  #ifdef GDO0
  Serial.printf("✓ GDO0 Pin: GPIO %d\n", GDO0);
  #else
  Serial.println("ERROR: GDO0 pin not defined in private.h");
  valid = false;
  #endif
  
  // Validate reading schedule
  if (!isValidReadingSchedule(readingSchedule)) {
    Serial.printf("ERROR: Invalid reading schedule '%s'\n", readingSchedule);
    Serial.println("       Expected: 'Monday-Friday', 'Monday-Saturday', or 'Monday-Sunday'");
    valid = false;
  } else {
    Serial.printf("✓ Reading Schedule: %s\n", readingSchedule);
  }
  
  Serial.println("================================\n");
  
