genestealer/everblu-meters-esp8266-improved/src/main.cpp
        Serial.printf("Data from meter:\n");
        Serial.printf("Liters : %d\nBattery (in months) : %d\nCounter : %d\nRSSI : %d\nTime start : %s\nTime end : %s\n\n",
                      pendingMeterData.liters, pendingMeterData.battery_left, pendingMeterData.reads_counter,
                      pendingMeterData.rssi, timeStartFormatted, timeEndFormatted);
        
        Serial.printf("RSSI (dBm) : %d\n", pendingMeterData.rssi_dbm);
        Serial.printf("RSSI (percentage) : %d\n", calculateMeterdBmToPercentage(pendingMeterData.rssi_dbm));
        Serial.printf("Signal quality (LQI) : %d\n", pendingMeterData.lqi);
        Serial.printf("Signal quality (LQI percentage) : %d\n", calculateLQIToPercentage(pendingMeterData.lqi));
        
        // Publish meter data
        snprintf(valueBuffer, sizeof(valueBuffer), "%d", pendingMeterData.liters);
        mqtt.publish("everblu/cyble/liters", valueBuffer, true);
        delay(5);
        
        snprintf(valueBuffer, sizeof(valueBuffer), "%d", pendingMeterData.reads_counter);
        mqtt.publish("everblu/cyble/counter", valueBuffer, true);
        delay(5);
        
        snprintf(valueBuffer, sizeof(valueBuffer), "%d", pendingMeterData.battery_left);
        mqtt.publish("everblu/cyble/battery", valueBuffer, true);
        delay(5);
        
        snprintf(valueBuffer, sizeof(valueBuffer), "%d", pendingMeterData.rssi_dbm);
        mqtt.publish("everblu/cyble/rssi_dbm", valueBuffer, true);
        delay(5);
        
        snprintf(valueBuffer, sizeof(valueBuffer), "%d", calculateMeterdBmToPercentage(pendingMeterData.rssi_dbm));
        mqtt.publish("everblu/cyble/rssi_percentage", valueBuffer, true);
        delay(5);
        
        snprintf(valueBuffer, sizeof(valueBuffer), "%d", pendingMeterData.lqi);
        mqtt.publish("everblu/cyble/lqi", valueBuffer, true);
        delay(5);
        
        mqtt.publish("everblu/cyble/timestamp", iso8601, true);
        delay(5);
        
        snprintf(valueBuffer, sizeof(valueBuffer), "%d", calculateLQIToPercentage(pendingMeterData.lqi));
        mqtt.publish("everblu/cyble/lqi_percentage", valueBuffer, true);
        delay(5);
        
        // Publish JSON
        char json[512];
        const char* jsonTemplate = "{\"liters\":%d,\"counter\":%d,\"battery\":%d,\"rssi\":%d,\"timestamp\":\"%s\"}";
        sprintf(json, jsonTemplate, pendingMeterData.liters, pendingMeterData.reads_counter,
                pendingMeterData.battery_left, pendingMeterData.rssi, iso8601);
        mqtt.publish("everblu/cyble/json", json, true);
        delay(5);
        
        // Auto-align reading time if enabled
        if (AUTO_ALIGN_READING_TIME) {
          int timeStart = pendingMeterData.time_start;
          int timeEnd = pendingMeterData.time_end;
          int centerHour = (timeStart + timeEnd) / 2;
          int alignedHour = (centerHour >= 12) ? 12 : centerHour;
          
          if (g_readHourUtc != alignedHour) {
            g_readHourUtc = alignedHour;
            g_readMinuteUtc = DEFAULT_READING_MINUTE_UTC;
            
            char readingTimeFormatted2[6];
            snprintf(readingTimeFormatted2, sizeof(readingTimeFormatted2), "%02d:%02d", g_readHourUtc, g_readMinuteUtc);
            mqtt.publish("everblu/cyble/reading_time", readingTimeFormatted2, true);
            delay(5);
            
            Serial.printf("> Auto-aligned reading time to %02d:%02d UTC (window %02d-%02d)\n",
                         g_readHourUtc, g_readMinuteUtc, timeStart, timeEnd);
          }
        }
        
        mqtt.publish("everblu/cyble/active_reading", "false", true);
        mqtt.publish("everblu/cyble/cc1101_state", "Idle", true);
        digitalWrite(LED_BUILTIN, HIGH); // Turn off LED
        
        // Reset retry counter and cooldown
        _retry = 0;
        lastFailedAttempt = 0;
        successfulReads++;
        lastErrorMessage = "None";
        
        // Publish success metrics
        char metricBuffer[16];
        snprintf(metricBuffer, sizeof(metricBuffer), "%lu", successfulReads);
        mqtt.publish("everblu/cyble/successful_reads", metricBuffer, true);
        
        snprintf(metricBuffer, sizeof(metricBuffer), "%lu", totalReadAttempts);
        mqtt.publish("everblu/cyble/total_attempts", metricBuffer, true);
        
        mqtt.publish("everblu/cyble/last_error", "None", true);
        
        // Perform adaptive frequency tracking
        adaptiveFrequencyTracking(pendingMeterData.freqest);
        
        Serial.printf("Data update complete.\n\n");
        
        // Return to idle
        enterState(STATE_IDLE);
      }
      break;
  }
}

void loop() {
  mqtt.loop();
  ArduinoOTA.handle();

  // State machine handler
  handleStateMachine();

  // Update diagnostics and Wi-Fi details every 5 minutes
  if (millis() - lastWifiUpdate > 300000) { // 5 minutes in ms
    publishWifiDetails();
    lastWifiUpdate = millis();
  }

  // ------------------------------
  // Connectivity watchdog & LED feedback
  // ------------------------------
  const bool wifiUp = mqtt.isWifiConnected();
  const bool mqttUp = mqtt.isMqttConnected();

  // Log transitions to connected state (one-time per connect)
  if (wifiUp && !g_prevWifiUp) {
    Serial.printf("[Wi-Fi] Connected to '%s' (IP: %s, RSSI: %d dBm)\n",
                  WiFi.SSID().c_str(), WiFi.localIP().toString().c_str(), WiFi.RSSI());
  }
  if (mqttUp && !g_prevMqttUp) {
    Serial.printf("[MQTT] Connected to %s:%d as '%s'\n",
                  mqtt.getMqttServerIp(), (int)mqtt.getMqttServerPort(), mqtt.getMqttClientName());
  }
  g_prevWifiUp = wifiUp;
  g_prevMqttUp = mqttUp;

  // Blink LED while offline (Wi-Fi or MQTT down)
  if (!(wifiUp && mqttUp)) {
    if (millis() - g_lastLedBlinkMs >= OFFLINE_LED_BLINK_MS) {
      g_ledState = !g_ledState;
      digitalWrite(LED_BUILTIN, g_ledState ? LOW : HIGH); // active-low on many boards
      g_lastLedBlinkMs = millis();
    }
  }

  // Wi-Fi timeout and retry hinting (EspMQTTClient already retries; we add logs/force retry after timeout)
  if (!wifiUp) {
    if (g_wifiOfflineSince == 0) g_wifiOfflineSince = millis();
    // Start (or continue) Wi-Fi attempt timer
    if (g_wifiAttemptStartMs == 0) g_wifiAttemptStartMs = millis();

